<?php
/* +----------------------------------------------------------------------
 * 作	者: venus <venus-wxp@outlook.com>
 +----------------------------------------------------------------------
 * 创建日期: 2017/9/20 11:41
 +----------------------------------------------------------------------
 * 文件描述: Base 模型
 +----------------------------------------------------------------------
 * 升级记录: 
 +----------------------------------------------------------------------
 */

namespace app\base\model;
use think\Model;

class Base extends Model {

    // 这里定义查询出的数据要进行隐藏的字段
    protected $hidden = [];
    // 这是定义每个模型关联的模型
    public $relationModels = [];
    // 这里定义每个模型的有数据字典的字段
    public $fieldDictNames = [];
    // 这里定义每个模型的上传文件字段
    public $uploadFields = [];

}