<?php
/* +----------------------------------------------------------------------
 * 作	者: venus <venus-wxp@outlook.com>
 +----------------------------------------------------------------------
 * 创建日期: 2017/11/14 12:16
 +----------------------------------------------------------------------
 * 文件描述: 发送邮件的配置
 +----------------------------------------------------------------------
 * 升级记录:
 +----------------------------------------------------------------------
 */

return [
    // 邮件服务器
    'host' => 'smtp.qq.com',
    // 用户名
    'username' => 'venus-wxp@qq.com',
    // 密码（邮件smtp的口令）
    'password' => 'juiylwmbodotdcfb',
    // 邮件传输所用的协议（ssl、tls）
    'secure' => 'ssl',
    // 端口号
    'port' => '465',
    // 设置发送邮件的者
    'from' => 'venus-wxp@qq.com',
    // 设置名称
    'name' => 'Venus',
    // 是否使用html
    'is_html' => true
];